** Org Clojure
#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((clojure . t)
   (sh . t)
   (emacs-lisp . t)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq org-babel-clojure-backend 'cider)
#+END_SRC

#+RESULTS:
: cider

#+BEGIN_SRC emacs-lisp
(require 'ob-clojure)
#+END_SRC

#+RESULTS:
: ob-clojure

#+BEGIN_SRC clojure
(+ 3 5 3)
(+ 1 3 3)
#+END_SRC

#+RESULTS:
: 11

** Clojure Run time Data Loading

#+BEGIN_SRC clojure
(use '[cemerick.pomegranate :only (add-dependencies)])
(add-dependencies :coordinates '[[com.datomic/datomic-free "0.9.5561.54"]]
                  :repositories (merge cemerick.pomegranate.aether/maven-central
                                          {"clojars" "https://clojars.org/repo"}))
#+END_SRC

#+RESULTS:
: nil{[clj-time "0.11.0"] #{[joda-time "2.8.2"]}, [org.clojure/clojure "1.8.0"] nil, [commons-io "2.5"] nil, [ring/ring-codec "1.0.1"] #{[commons-codec "1.6"]}, [ring-transit-middleware "0.1.3"] #{[org.clojure/clojure "1.8.0"] [com.cognitect/transit-clj "0.8.285" :exclusions [[commons-codec]]] [ring/ring-core "1.5.0"]}, [org.clojure/tools.reader "0.9.1"] nil, [crypto-equality "1.0.0"] nil, [com.googlecode.json-simple/json-simple "1.1.1" :exclusions [[junit]]] nil, [commons-codec "1.6"] nil, [com.cognitect/transit-clj "0.8.285" :exclusions [[commons-codec]]] #{[com.cognitect/transit-java "0.8.311"]}, [crypto-random "1.2.0"] nil, [ring/ring-core "1.5.0"] #{[clj-time "0.11.0"] [commons-io "2.5"] [ring/ring-codec "1.0.1"] [org.clojure/tools.reader "0.9.1"] [crypto-equality "1.0.0"] [crypto-random "1.2.0"] [commons-fileupload "1.3.1"]}, [com.cognitect/transit-java "0.8.311"] #{[org.msgpack/msgpack "0.6.10"] [com.fasterxml.jackson.core/jackson-core "2.3.2"]}, [org.msgpack/msgpack "0.6.10"] #{[com.googlecode.json-simple/json-simple "1.1.1" :exclusions [[junit]]] [org.javassist/javassist "3.18.1-GA"]}, [com.fasterxml.jackson.core/jackson-core "2.3.2"] nil, [org.javassist/javassist "3.18.1-GA"] nil, [commons-fileupload "1.3.1"] nil, [joda-time "2.8.2"] nil}

#+BEGIN_SRC clojure
(map #(vector %) '( 1 2 3))
#+END_SRC

#+RESULTS:
| 1 |
| 2 |
| 3 |
** Add Transient in Websocket
#+BEGIN_SRC clojure
(require '[cognitect.transit :as transit])
(import [java.io ByteArrayInputStream ByteArrayOutputStream])

;; Write data to a stream
(def out (ByteArrayOutputStream. 4096))
(def writer (transit/writer out :json))
(transit/write writer "foo")
(transit/write writer {:a [1 2]})

;; Take a peek at the JSON
(.toString out)
;; => "{\"~#'\":\"foo\"} [\"^ \",\"~:a\",[1,2]]"

;; Read data from a stream
(def in (ByteArrayInputStream. (.toByteArray out)))
(def reader (transit/reader in :json))
'( (transit/read reader) (transit/read reader))  ;; => "foo"
#+END_SRC

#+RESULTS:
: niljava.io.ByteArrayOutputStream#'user/out#'user/writernilnil"[\"~#'\",\"foo\"] [\"^ \",\"~:a\",[1,2]]"#'user/in#'user/reader((transit/read reader) (transit/read reader))
** dynamic binding
#+BEGIN_SRC clojure
(def ^:dynamic x 1 )
(def ^:dynamic x 1 )
(binding [x 2 y 3]
  (+ x y ))
#+END_SRC

#+RESULTS:
: #'devops15.example-test/x#'devops15.example-test/x

